app/controllers/messages_controller.rb

	def create
		Message.create(message_params)
---
INSERT INTO "messages" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "stuff"], ["description", "stuff"], ["created_at", "2016-05-20 20:43:47.945806"], ["updated_at", "2016-05-20 20:43:47.945806"]]

	def update
		@message = Message.find(params[:id])
		@message.update_attributes(message_params)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "partial partial partial dry dry dry edit edit edit123123123 lololololol"], ["updated_at", "2016-06-02 20:23:55.732496"], ["id", 6]]